rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_TCD_0.h
#define TCD_0_TCD9_CITER_ELINKYES_CITER_MASK     (0x1FFU)
#define TCD_0_TCD9_CITER_ELINKYES_CITER_SHIFT    (0U)
#define TCD_0_TCD9_CITER_ELINKYES_CITER_WIDTH    (9U)
#define TCD_0_TCD9_CITER_ELINKYES_CITER(x)       (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD9_CITER_ELINKYES_CITER_SHIFT)) & TCD_0_TCD9_CITER_ELINKYES_CITER_MASK)

#define TCD_0_TCD9_CITER_ELINKYES_LINKCH_MASK    (0x3E00U)
#define TCD_0_TCD9_CITER_ELINKYES_LINKCH_SHIFT   (9U)
#define TCD_0_TCD9_CITER_ELINKYES_LINKCH_WIDTH   (5U)
#define TCD_0_TCD9_CITER_ELINKYES_LINKCH(x)      (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD9_CITER_ELINKYES_LINKCH_SHIFT)) & TCD_0_TCD9_CITER_ELINKYES_LINKCH_MASK)

#define TCD_0_TCD9_CITER_ELINKYES_ELINK_MASK     (0x8000U)
#define TCD_0_TCD9_CITER_ELINKYES_ELINK_SHIFT    (15U)
#define TCD_0_TCD9_CITER_ELINKYES_ELINK_WIDTH    (1U)
#define TCD_0_TCD9_CITER_ELINKYES_ELINK(x)       (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD9_CITER_ELINKYES_ELINK_SHIFT)) & TCD_0_TCD9_CITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name TCD9_DLAST_SGA - TCD Last Destination Address Adjustment / Scatter Gather Address */
/*! @{ */

#define TCD_0_TCD9_DLAST_SGA_DLAST_SGA_MASK      (0xFFFFFFFFU)
#define TCD_0_TCD9_DLAST_SGA_DLAST_SGA_SHIFT     (0U)
#define TCD_0_TCD9_DLAST_SGA_DLAST_SGA_WIDTH     (32U)
#define TCD_0_TCD9_DLAST_SGA_DLAST_SGA(x)        (((uint32_t)(((uint32_t)(x)) << TCD_0_TCD9_DLAST_SGA_DLAST_SGA_SHIFT)) & TCD_0_TCD9_DLAST_SGA_DLAST_SGA_MASK)
/*! @} */

/*! @name TCD9_CSR - TCD Control and Status */
/*! @{ */

#define TCD_0_TCD9_CSR_START_MASK                (0x1U)
#define TCD_0_TCD9_CSR_START_SHIFT               (0U)
#define TCD_0_TCD9_CSR_START_WIDTH               (1U)
#define TCD_0_TCD9_CSR_START(x)                  (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD9_CSR_START_SHIFT)) & TCD_0_TCD9_CSR_START_MASK)

#define TCD_0_TCD9_CSR_INTMAJOR_MASK             (0x2U)
#define TCD_0_TCD9_CSR_INTMAJOR_SHIFT            (1U)
#define TCD_0_TCD9_CSR_INTMAJOR_WIDTH            (1U)
#define TCD_0_TCD9_CSR_INTMAJOR(x)               (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD9_CSR_INTMAJOR_SHIFT)) & TCD_0_TCD9_CSR_INTMAJOR_MASK)

#define TCD_0_TCD9_CSR_INTHALF_MASK              (0x4U)
#define TCD_0_TCD9_CSR_INTHALF_SHIFT             (2U)
#define TCD_0_TCD9_CSR_INTHALF_WIDTH             (1U)
#define TCD_0_TCD9_CSR_INTHALF(x)                (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD9_CSR_INTHALF_SHIFT)) & TCD_0_TCD9_CSR_INTHALF_MASK)

#define TCD_0_TCD9_CSR_DREQ_MASK                 (0x8U)
#define TCD_0_TCD9_CSR_DREQ_SHIFT                (3U)
#define TCD_0_TCD9_CSR_DREQ_WIDTH                (1U)
#define TCD_0_TCD9_CSR_DREQ(x)                   (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD9_CSR_DREQ_SHIFT)) & TCD_0_TCD9_CSR_DREQ_MASK)

#define TCD_0_TCD9_CSR_ESG_MASK                  (0x10U)
#define TCD_0_TCD9_CSR_ESG_SHIFT                 (4U)
#define TCD_0_TCD9_CSR_ESG_WIDTH                 (1U)
#define TCD_0_TCD9_CSR_ESG(x)                    (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD9_CSR_ESG_SHIFT)) & TCD_0_TCD9_CSR_ESG_MASK)

#define TCD_0_TCD9_CSR_MAJORELINK_MASK           (0x20U)
#define TCD_0_TCD9_CSR_MAJORELINK_SHIFT          (5U)
#define TCD_0_TCD9_CSR_MAJORELINK_WIDTH          (1U)
#define TCD_0_TCD9_CSR_MAJORELINK(x)             (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD9_CSR_MAJORELINK_SHIFT)) & TCD_0_TCD9_CSR_MAJORELINK_MASK)

#define TCD_0_TCD9_CSR_ESDA_MASK                 (0x80U)
#define TCD_0_TCD9_CSR_ESDA_SHIFT                (7U)
#define TCD_0_TCD9_CSR_ESDA_WIDTH                (1U)
#define TCD_0_TCD9_CSR_ESDA(x)                   (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD9_CSR_ESDA_SHIFT)) & TCD_0_TCD9_CSR_ESDA_MASK)

#define TCD_0_TCD9_CSR_MAJORLINKCH_MASK          (0x1F00U)
#define TCD_0_TCD9_CSR_MAJORLINKCH_SHIFT         (8U)
#define TCD_0_TCD9_CSR_MAJORLINKCH_WIDTH         (5U)
#define TCD_0_TCD9_CSR_MAJORLINKCH(x)            (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD9_CSR_MAJORLINKCH_SHIFT)) & TCD_0_TCD9_CSR_MAJORLINKCH_MASK)

#define TCD_0_TCD9_CSR_BWC_MASK                  (0xC000U)
#define TCD_0_TCD9_CSR_BWC_SHIFT                 (14U)
#define TCD_0_TCD9_CSR_BWC_WIDTH                 (2U)
#define TCD_0_TCD9_CSR_BWC(x)                    (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD9_CSR_BWC_SHIFT)) & TCD_0_TCD9_CSR_BWC_MASK)
/*! @} */

/*! @name TCD9_BITER_ELINKNO - TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define TCD_0_TCD9_BITER_ELINKNO_BITER_MASK      (0x7FFFU)
#define TCD_0_TCD9_BITER_ELINKNO_BITER_SHIFT     (0U)
#define TCD_0_TCD9_BITER_ELINKNO_BITER_WIDTH     (15U)
#define TCD_0_TCD9_BITER_ELINKNO_BITER(x)        (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD9_BITER_ELINKNO_BITER_SHIFT)) & TCD_0_TCD9_BITER_ELINKNO_BITER_MASK)

#define TCD_0_TCD9_BITER_ELINKNO_ELINK_MASK      (0x8000U)
#define TCD_0_TCD9_BITER_ELINKNO_ELINK_SHIFT     (15U)
#define TCD_0_TCD9_BITER_ELINKNO_ELINK_WIDTH     (1U)
#define TCD_0_TCD9_BITER_ELINKNO_ELINK(x)        (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD9_BITER_ELINKNO_ELINK_SHIFT)) & TCD_0_TCD9_BITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD9_BITER_ELINKYES - TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define TCD_0_TCD9_BITER_ELINKYES_BITER_MASK     (0x1FFU)
#define TCD_0_TCD9_BITER_ELINKYES_BITER_SHIFT    (0U)
#define TCD_0_TCD9_BITER_ELINKYES_BITER_WIDTH    (9U)
#define TCD_0_TCD9_BITER_ELINKYES_BITER(x)       (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD9_BITER_ELINKYES_BITER_SHIFT)) & TCD_0_TCD9_BITER_ELINKYES_BITER_MASK)

#define TCD_0_TCD9_BITER_ELINKYES_LINKCH_MASK    (0x3E00U)
#define TCD_0_TCD9_BITER_ELINKYES_LINKCH_SHIFT   (9U)
#define TCD_0_TCD9_BITER_ELINKYES_LINKCH_WIDTH   (5U)
#define TCD_0_TCD9_BITER_ELINKYES_LINKCH(x)      (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD9_BITER_ELINKYES_LINKCH_SHIFT)) & TCD_0_TCD9_BITER_ELINKYES_LINKCH_MASK)

#define TCD_0_TCD9_BITER_ELINKYES_ELINK_MASK     (0x8000U)
#define TCD_0_TCD9_BITER_ELINKYES_ELINK_SHIFT    (15U)
#define TCD_0_TCD9_BITER_ELINKYES_ELINK_WIDTH    (1U)
#define TCD_0_TCD9_BITER_ELINKYES_ELINK(x)       (((uint16_t)(((uint16_t)(x)) << TCD_0_TCD9_BITER_ELINKYES_ELINK_SHIFT)) & TCD_0_TCD9_BITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name CH10_CSR - Channel Control and Status */
/*! @{ */

#define TCD_0_CH10_CSR_ERQ_MASK                  (0x1U)
#define TCD_0_CH10_CSR_ERQ_SHIFT                 (0U)
#define TCD_0_CH10_CSR_ERQ_WIDTH                 (1U)
#define TCD_0_CH10_CSR_ERQ(x)                    (((uint32_t)(((uint32_t)(x)) << TCD_0_CH10_CSR_ERQ_SHIFT)) & TCD_0_CH10_CSR_ERQ_MASK)

#define TCD_0_CH10_CSR_EARQ_MASK                 (0x2U)
#define TCD_0_CH10_CSR_EARQ_SHIFT                (1U)
#define TCD_0_CH10_CSR_EARQ_WIDTH                (1U)
#define TCD_0_CH10_CSR_EARQ(x)                   (((uint32_t)(((uint32_t)(x)) << TCD_0_CH10_CSR_EARQ_SHIFT)) & TCD_0_CH10_CSR_EARQ_MASK)

#define TCD_0_CH10_CSR_EEI_MASK                  (0x4U)
#define TCD_0_CH10_CSR_EEI_SHIFT                 (2U)
#define TCD_0_CH10_CSR_EEI_WIDTH                 (1U)
#define TCD_0_CH10_CSR_EEI(x)                    (((uint32_t)(((uint32_t)(x)) << TCD_0_CH10_CSR_EEI_SHIFT)) & TCD_0_CH10_CSR_EEI_MASK)

#define TCD_0_CH10_CSR_EBW_MASK                  (0x8U)
#define TCD_0_CH10_CSR_EBW_SHIFT                 (3U)
#define TCD_0_CH10_CSR_EBW_WIDTH                 (1U)
#define TCD_0_CH10_CSR_EBW(x)                    (((uint32_t)(((uint32_t)(x)) << TCD_0_CH10_CSR_EBW_SHIFT)) & TCD_0_CH10_CSR_EBW_MASK)

#define TCD_0_CH10_CSR_DONE_MASK                 (0x40000000U)
#define TCD_0_CH10_CSR_DONE_SHIFT                (30U)
#define TCD_0_CH10_CSR_DONE_WIDTH                (1U)
#define TCD_0_CH10_CSR_DONE(x)                   (((uint32_t)(((uint32_t)(x)) << TCD_0_CH10_CSR_DONE_SHIFT)) & TCD_0_CH10_CSR_DONE_MASK)

#define TCD_0_CH10_CSR_ACTIVE_MASK               (0x80000000U)
#define TCD_0_CH10_CSR_ACTIVE_SHIFT              (31U)
#define TCD_0_CH10_CSR_ACTIVE_WIDTH              (1U)
#define TCD_0_CH10_CSR_ACTIVE(x)                 (((uint32_t)(((uint32_t)(x)) << TCD_0_CH10_CSR_ACTIVE_SHIFT)) & TCD_0_CH10_CSR_ACTIVE_MASK)
/*! @} */

